Documents/csys1_Утилизация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>csys1_Утилизация</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.csys1_ПодразделениеКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодВыпуска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неисправность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.csys1_УтилизацияНеисправность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатОсмотра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.csys1_УтилизацияРезультатОсмотра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РыночнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/csys1_Утилизация/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	////{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	//Макет = Документы.csys1_Утилизация.ПолучитьМакет("Печать");
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	csys1_Утилизация.Автор,
	//|	csys1_Утилизация.Дата,
	//|	csys1_Утилизация.ДокументОснование,
	//|	csys1_Утилизация.Комментарий,
	//|	csys1_Утилизация.Контрагент,
	//|	csys1_Утилизация.Номер,
	//|	csys1_Утилизация.Организация,
	//|	csys1_Утилизация.Подразделение,
	//|	csys1_Утилизация.Номенклатура.(
	//|		НомерСтроки,
	//|		Наименование,
	//|		ИнвентарныйНомер,
	//|		Количество,
	//|		БалансоваяСтоимость,
	//|		ПроцентИзноса,
	//|		ГодВыпуска,
	//|		Неисправность,
	//|		РезультатОсмотра,
	//|		СерийныйНомер,
	//|		РыночнаяСтоимость
	//|	)
	//|ИЗ
	//|	Документ.csys1_Утилизация КАК csys1_Утилизация
	//|ГДЕ
	//|	csys1_Утилизация.Ссылка В (&Ссылка)";
	//Запрос.Параметры.Вставить("Ссылка", Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();

	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//Шапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
	//ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	//Подвал = Макет.ПолучитьОбласть("Подвал");

	//ТабДок.Очистить();

	//ВставлятьРазделительСтраниц = Ложь;
	//Пока Выборка.Следующий() Цикл
	//	Если ВставлятьРазделительСтраниц Тогда
	//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;

	//	ТабДок.Вывести(ОбластьЗаголовок);

	//	Шапка.Параметры.Заполнить(Выборка);
	//	ТабДок.Вывести(Шапка, Выборка.Уровень());

	//	ТабДок.Вывести(ОбластьНоменклатураШапка);
	//	ВыборкаНоменклатура = Выборка.Номенклатура.Выбрать();
	//	Пока ВыборкаНоменклатура.Следующий() Цикл
	//		ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
	//		ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
	//	КонецЦикла;

	//	Подвал.Параметры.Заполнить(Выборка);
	//	ТабДок.Вывести(Подвал);

	//	ВставлятьРазделительСтраниц = Истина;
	//КонецЦикла;    
	
	
	//}}
	Макет = Документы.csys1_Утилизация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	csys1_Утилизация.Автор КАК Автор,
	|	csys1_Утилизация.Дата КАК Дата,
	|	csys1_Утилизация.Контрагент КАК Контрагент,
	|	csys1_Утилизация.Контрагент.НаименованиеПолное КАК КонтрагентНаименование,
	|	csys1_Утилизация.Подразделение КАК Подразделение,
	|	csys1_Утилизация.Номер КАК Номер,
	|	csys1_Утилизация.Организация КАК Организация,
	|	csys1_Утилизация.Номенклатура.(
	|		НомерСтроки КАК НомерСтроки,
	|		Наименование КАК Наименование,
	|		ИнвентарныйНомер КАК ИнвентарныйНомер,
	|		Количество КАК Количество,
	|		БалансоваяСтоимость КАК БалансоваяСтоимость,
	|		ПроцентИзноса КАК ПроцентИзноса,
	|		ГодВыпуска КАК ГодВыпуска,
	|		Неисправность КАК Неисправность,
	|		РезультатОсмотра КАК РезультатОсмотра,
	|		РыночнаяСтоимость КАК РыночнаяСтоимость,
	|		СерийныйНомер КАК СерийныйНомер
	|	) КАК Номенклатура,
	|	csys1_Утилизация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.csys1_Утилизация КАК csys1_Утилизация
	|ГДЕ
	|	csys1_Утилизация.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка = Макет.ПолучитьОбласть("Шапка");

	ТабДок.Очистить();
	Пока Выборка.Следующий() Цикл
		
		ВыборкаНоменклатура = Выборка.Номенклатура.Выбрать();
    	
		Пока ВыборкаНоменклатура.Следующий() Цикл
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.Заполнить(ВыборкаНоменклатура);
			Шапка.Параметры.ИНН = Выборка.Организация.ИНН; 
			Шапка.Параметры.Номер = Строка(Выборка.Номер) + "/" + ВыборкаНоменклатура.НомерСтроки;
			
			ТабДок.Вывести(Шапка);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
		
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	
	
	
КонецПроцедуры
